app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-03-16 18:02:55.908679"], ["updated_at", "2015-03-16 18:02:55.908679"]]
---
    def create
        @post = Post.new(params[:article])

        @post.save